app/Models/MusicasModel.php

SELECT *
FROM `musicas`
WHERE `registro` = '83'
 LIMIT 1
---
    public function getMusicaByRegistro($registro)
    {
        return $this->where('registro',$registro)->get()->first();

SELECT *
FROM `musicas`
WHERE `musico_id` = '3'
---
    public function getMusicasByMusicoId($musico_id)
    {
        return $this->where('musico_id',$musico_id)->get()->getResultArray();