app/Models/MusicasModel.php

    public function getMusicaByRegistro($registro)
    {
        return $this->select('musicas.*,usuarios.nome as artista')->join('usuarios','usuarios.id = musico_id')->where('registro',$registro)->first();
---
SELECT `musicas`.*, `usuarios`.`nome` as `artista`
FROM `musicas`
JOIN `usuarios` ON `usuarios`.`id` = `musico_id`
WHERE `registro` = '83'
 LIMIT 1

    public function getMusicasByMusicoId($musico_id)
    {
        return $this->select('musicas.*,AVG(usuario_avalia_musica.avaliacao) as media')->join('usuario_avalia_musica','usuario_avalia_musica.musica_registro = registro','left')->where('musico_id',$musico_id)->groupBy('musicas.registro')->get()->getResultArray();
---
SELECT `musicas`.*, AVG(usuario_avalia_musica.avaliacao) as media
FROM `musicas`
LEFT JOIN `usuario_avalia_musica` ON `usuario_avalia_musica`.`musica_registro` = `registro`
WHERE `musico_id` = '3'
GROUP BY `musicas`.`registro`

    public function newPlay($registro)
    {
        $this->set('reproducoes','reproducoes+1',FALSE);
        return $this->update($registro);
---
UPDATE `musicas` SET `reproducoes` = reproducoes+1
WHERE `musicas`.`registro` IN ('83')

    public function getTop($n = 5)
    {
        return $this->select('musicas.*,usuarios.nome as artistaNome')->join('usuarios','usuarios.id = musico_id')->orderBy('reproducoes','DESC')->get(5)->getResultArray();
---
SELECT `musicas`.*, `usuarios`.`nome` as `artistaNome`
FROM `musicas`
JOIN `usuarios` ON `usuarios`.`id` = `musico_id`
ORDER BY `reproducoes` DESC
 LIMIT 5