app/Models/PlaylistsMusicasModel.php

SELECT `musicas`.*, `usuarios`.`nome` as `artistaNome`
FROM `playlists_musicas`
JOIN `musicas` ON `musicas`.`registro` = `musica_id`
LEFT JOIN `usuarios` ON `usuarios`.`id` = `musicas`.`musico_id`
WHERE `playlist_id` = '55'
---
    public function getMusicasPlaylists($playlist_id)
    {
        return $this->select('musicas.*')->
        join('musicas','musicas.registro = musica_id')->
        where('playlist_id',$playlist_id)->
        get()->getResultArray();