app/Models/PlaylistsModel.php

SELECT *
FROM `playlists`
WHERE `usuario_id` = '3'
---
    public function getUserPlaylists($id)
    {
        return $this->where('usuario_id',$id)->get()->getResultArray();

SELECT *
FROM `playlists`
WHERE `id` = '66'
 LIMIT 1
---
    public function getPlaylistById($id)
    {
        return $this->where('id',$id)->first();

SELECT `playlists`.*, `usuarios`.`nome` as `dono`
FROM `playlists`
JOIN `usuarios` ON `usuarios`.`id` = `usuario_id`
WHERE `publica` = 1
ORDER BY RAND()
 LIMIT 5
---
    public function getRandPlaylists($quantidade)
    {
        return $this->select('playlists.*,usuarios.nome as dono')->
        join('usuarios','usuarios.id = usuario_id')->
        where('publica',true)->
        orderBy('RAND()')->
        get($quantidade)->getResultArray();