app/Models/UsuariosModel.php

    public function getUserByEmail($email)
    {
        return $this->where('email',$email)->first();
---
SELECT *
FROM `usuarios`
WHERE `email` = 'vinnyzika2.0@gmail.com'
 LIMIT 1